In [1]:
import pandas as pd
import numpy as np

In [2]:
# Начинаем с серии

lst = ['asd', 'qwe', None, np.nan, 'asdf']

In [3]:
s = pd.Series(lst)

In [4]:
s.isnull()

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [7]:
# эта функция является маской:

s[s.isnull()]
s[~s.isnull()]
s[s.notnull()]

0     asd
1     qwe
4    asdf
dtype: object

In [ ]:
# Еще возможности фильтрации nan

In [8]:
from numpy import nan as NA

In [9]:
s2 = pd.Series([10, NA, 40, NA, 100])

In [10]:
s2

0     10.0
1      NaN
2     40.0
3      NaN
4    100.0
dtype: float64

In [12]:
s2.dropna()

0     10.0
2     40.0
4    100.0
dtype: float64

In [13]:
s2

0     10.0
1      NaN
2     40.0
3      NaN
4    100.0
dtype: float64

In [14]:
df = pd.DataFrame([[1,7,9],[2, NA, NA],[NA, NA, NA],[NA, 10, 4]])

In [15]:
df

     0     1    2
0  1.0   7.0  9.0
1  2.0   NaN  NaN
2  NaN   NaN  NaN
3  NaN  10.0  4.0

In [16]:
df11 = df.dropna()

In [17]:
# по умолчанию идем по строкам
# в итоге остаются только строчки где нет ни одного пропуска
df11

     0    1    2
0  1.0  7.0  9.0

In [20]:
# если надо удалять только строки, в которых все nan - нет ни одного значения вообще прописываем параметр how

In [21]:
df11 = df.dropna(how = 'all')

In [22]:
df11

     0     1    2
0  1.0   7.0  9.0
1  2.0   NaN  NaN
3  NaN  10.0  4.0

In [23]:
df11 = df.dropna(axis = 1, how = 'all')

In [24]:
df11

     0     1    2
0  1.0   7.0  9.0
1  2.0   NaN  NaN
2  NaN   NaN  NaN
3  NaN  10.0  4.0

In [ ]:
# Параметром thresh 

# мы можем сообщать функции dropna сколько не пустых значений должно 
# быть в нашей строке/колонке. Например, если thresh=3, то функция dropna будет проверять 
# чтобы в строке/колонке было минимум 3 непропущенных значения. Если больше, то хорошо, 
# а вот если меньше, то такая строка будет удалена.

In [73]:
# Задание 

# На вход функции подаётся датафрейм:


_df = pd.DataFrame([[0, np.nan, np.nan, 3, 4, 5, 6, 7, 8, np.nan],
                    [np.nan, 11, np.nan, 13, 14, 15, 16, 17, 18, np.nan],
                    [np.nan, np.nan, 22, 23, 24, 25, 26, 27, 28, np.nan],
                    [30, 31, 32, 33, 34, np.nan, 36, 37, 38, np.nan],
                    [40, 41, np.nan, 43, 44, 45, 46, 47, 48, np.nan],
                    [50, 51, 52, np.nan, 54, 55, np.nan, 57, 58, np.nan],
                    [60, 61, 62, 63, 64, np.nan, 66, 67, np.nan, np.nan],
                    [np.nan, 71, 72, 73, 74, 75, 76, 77, 78, np.nan],
                    [80, 81, 82, 83, 84, 85, np.nan, 87, 88, np.nan],
                    [90, 91, 92, 93, 94, 95, 96, 97, 98, np.nan]],
                   columns=["A", "B", "C", "D", "E", "F", "G", "H", "J", "K"])

# При помощи функции dropna удалите колонки в которых полностью отсутствуют значения (везде NaN)

In [71]:
_df.dropna(axis = 1, how = 'all')

      A     B     C     D   E     F     G   H     J
0   0.0   NaN   NaN   3.0   4   5.0   6.0   7   8.0
1   NaN  11.0   NaN  13.0  14  15.0  16.0  17  18.0
2   NaN   NaN  22.0  23.0  24  25.0  26.0  27  28.0
3  30.0  31.0  32.0  33.0  34   NaN  36.0  37  38.0
4  40.0  41.0   NaN  43.0  44  45.0  46.0  47  48.0
5  50.0  51.0  52.0   NaN  54  55.0   NaN  57  58.0
6  60.0  61.0  62.0  63.0  64   NaN  66.0  67   NaN
7   NaN  71.0  72.0  73.0  74  75.0  76.0  77  78.0
8  80.0  81.0  82.0  83.0  84  85.0   NaN  87  88.0
9  90.0  91.0  92.0  93.0  94  95.0  96.0  97  98.0

In [32]:
# При помощи функции dropna удалите строчки, где в ячейках А, С, D, G меньше трех значений 
# (т.е. строки с двумя и более пропущенными значениями в ячейках А, С, D, G должны быть удалены;
#  c одним пропуском - ок)

_df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K'], dtype='object')

In [74]:
_df1 = _df[['A', 'C', 'D', 'G']]

In [75]:
_df1

      A     C     D     G
0   0.0   NaN   3.0   6.0
1   NaN   NaN  13.0  16.0
2   NaN  22.0  23.0  26.0
3  30.0  32.0  33.0  36.0
4  40.0   NaN  43.0  46.0
5  50.0  52.0   NaN   NaN
6  60.0  62.0  63.0  66.0
7   NaN  72.0  73.0  76.0
8  80.0  82.0  83.0   NaN
9  90.0  92.0  93.0  96.0

In [76]:
_df1.dropna(thresh=3).index

Int64Index([0, 2, 3, 4, 6, 7, 8, 9], dtype='int64')

In [95]:
_df.loc[_df1.dropna(thresh=3).index]

      A     B     C     D   E     F     G   H     J   K
0   0.0   NaN   NaN   3.0   4   5.0   6.0   7   8.0 NaN
2   NaN   NaN  22.0  23.0  24  25.0  26.0  27  28.0 NaN
3  30.0  31.0  32.0  33.0  34   NaN  36.0  37  38.0 NaN
4  40.0  41.0   NaN  43.0  44  45.0  46.0  47  48.0 NaN
6  60.0  61.0  62.0  63.0  64   NaN  66.0  67   NaN NaN
7   NaN  71.0  72.0  73.0  74  75.0  76.0  77  78.0 NaN
8  80.0  81.0  82.0  83.0  84  85.0   NaN  87  88.0 NaN
9  90.0  91.0  92.0  93.0  94  95.0  96.0  97  98.0 NaN

In [ ]:
# Не пользуясь функцией dropna, отфильтруйте датафрейм так чтобы остались строчки, где в ячейках C и G нет пропусков.

In [98]:
_df

      A     B     C     D   E     F     G   H     J   K
0   0.0   NaN   NaN   3.0   4   5.0   6.0   7   8.0 NaN
1   NaN  11.0   NaN  13.0  14  15.0  16.0  17  18.0 NaN
2   NaN   NaN  22.0  23.0  24  25.0  26.0  27  28.0 NaN
3  30.0  31.0  32.0  33.0  34   NaN  36.0  37  38.0 NaN
4  40.0  41.0   NaN  43.0  44  45.0  46.0  47  48.0 NaN
5  50.0  51.0  52.0   NaN  54  55.0   NaN  57  58.0 NaN
6  60.0  61.0  62.0  63.0  64   NaN  66.0  67   NaN NaN
7   NaN  71.0  72.0  73.0  74  75.0  76.0  77  78.0 NaN
8  80.0  81.0  82.0  83.0  84  85.0   NaN  87  88.0 NaN
9  90.0  91.0  92.0  93.0  94  95.0  96.0  97  98.0 NaN

In [97]:
_df[['C', 'G']]

      C     G
0   NaN   6.0
1   NaN  16.0
2  22.0  26.0
3  32.0  36.0
4   NaN  46.0
5  52.0   NaN
6  62.0  66.0
7  72.0  76.0
8  82.0   NaN
9  92.0  96.0

In [124]:
_df['C'].notna() & _df['G'].notna()

0    False
1    False
2     True
3     True
4    False
5    False
6     True
7     True
8    False
9     True
dtype: bool

In [125]:
_df[_df['C'].notna() & _df['G'].notna()]

      A     B     C     D   E     F     G   H     J   K
2   NaN   NaN  22.0  23.0  24  25.0  26.0  27  28.0 NaN
3  30.0  31.0  32.0  33.0  34   NaN  36.0  37  38.0 NaN
6  60.0  61.0  62.0  63.0  64   NaN  66.0  67   NaN NaN
7   NaN  71.0  72.0  73.0  74  75.0  76.0  77  78.0 NaN
9  90.0  91.0  92.0  93.0  94  95.0  96.0  97  98.0 NaN

# Заполнение пропущенных значений

In [127]:
_df

      A     B     C     D   E     F     G   H     J   K
0   0.0   NaN   NaN   3.0   4   5.0   6.0   7   8.0 NaN
1   NaN  11.0   NaN  13.0  14  15.0  16.0  17  18.0 NaN
2   NaN   NaN  22.0  23.0  24  25.0  26.0  27  28.0 NaN
3  30.0  31.0  32.0  33.0  34   NaN  36.0  37  38.0 NaN
4  40.0  41.0   NaN  43.0  44  45.0  46.0  47  48.0 NaN
5  50.0  51.0  52.0   NaN  54  55.0   NaN  57  58.0 NaN
6  60.0  61.0  62.0  63.0  64   NaN  66.0  67   NaN NaN
7   NaN  71.0  72.0  73.0  74  75.0  76.0  77  78.0 NaN
8  80.0  81.0  82.0  83.0  84  85.0   NaN  87  88.0 NaN
9  90.0  91.0  92.0  93.0  94  95.0  96.0  97  98.0 NaN

In [128]:
_df.fillna(0)

      A     B     C     D   E     F     G   H     J    K
0   0.0   0.0   0.0   3.0   4   5.0   6.0   7   8.0  0.0
1   0.0  11.0   0.0  13.0  14  15.0  16.0  17  18.0  0.0
2   0.0   0.0  22.0  23.0  24  25.0  26.0  27  28.0  0.0
3  30.0  31.0  32.0  33.0  34   0.0  36.0  37  38.0  0.0
4  40.0  41.0   0.0  43.0  44  45.0  46.0  47  48.0  0.0
5  50.0  51.0  52.0   0.0  54  55.0   0.0  57  58.0  0.0
6  60.0  61.0  62.0  63.0  64   0.0  66.0  67   0.0  0.0
7   0.0  71.0  72.0  73.0  74  75.0  76.0  77  78.0  0.0
8  80.0  81.0  82.0  83.0  84  85.0   0.0  87  88.0  0.0
9  90.0  91.0  92.0  93.0  94  95.0  96.0  97  98.0  0.0

In [129]:
# Кастомизируем заполнение ячеек:

_df.fillna({'A': 0, 'B': 'hui'})

      A     B     C     D   E     F     G   H     J   K
0   0.0   hui   NaN   3.0   4   5.0   6.0   7   8.0 NaN
1   0.0  11.0   NaN  13.0  14  15.0  16.0  17  18.0 NaN
2   0.0   hui  22.0  23.0  24  25.0  26.0  27  28.0 NaN
3  30.0  31.0  32.0  33.0  34   NaN  36.0  37  38.0 NaN
4  40.0  41.0   NaN  43.0  44  45.0  46.0  47  48.0 NaN
5  50.0  51.0  52.0   NaN  54  55.0   NaN  57  58.0 NaN
6  60.0  61.0  62.0  63.0  64   NaN  66.0  67   NaN NaN
7   0.0  71.0  72.0  73.0  74  75.0  76.0  77  78.0 NaN
8  80.0  81.0  82.0  83.0  84  85.0   NaN  87  88.0 NaN
9  90.0  91.0  92.0  93.0  94  95.0  96.0  97  98.0 NaN

In [131]:
# более продвинутые способы заполнения значений

# Методы заполнения:

# method='ffill':  распространяет последнее наблюдаемое значение вперед, пока не встретится другое значение.
# method='bfill':  распространяет первое наблюдаемое значение назад, пока не встретится другое значение.


# регулируем как заполнять:

df3 = pd.DataFrame(np.random.rand(6, 3))
df3.iloc[2:, 1] = np.NaN
df3.iloc[4:, 2] = np.NaN

In [133]:
df3

          0         1         2
0  0.538274  0.267049  0.550702
1  0.001706  0.557345  0.973431
2  0.978978       NaN  0.392511
3  0.884089       NaN  0.900421
4  0.178159       NaN       NaN
5  0.579322       NaN       NaN

In [135]:
df3.fillna(method = 'ffill')

          0         1         2
0  0.538274  0.267049  0.550702
1  0.001706  0.557345  0.973431
2  0.978978  0.557345  0.392511
3  0.884089  0.557345  0.900421
4  0.178159  0.557345  0.900421
5  0.579322  0.557345  0.900421

In [137]:
# заполняет вперед заданное количество ячеек

df3.fillna(method = 'ffill', limit = 1)

          0         1         2
0  0.538274  0.267049  0.550702
1  0.001706  0.557345  0.973431
2  0.978978  0.557345  0.392511
3  0.884089       NaN  0.900421
4  0.178159       NaN  0.900421
5  0.579322       NaN       NaN

In [139]:
df3

          0         1         2
0  0.538274  0.267049  0.550702
1  0.001706  0.557345  0.973431
2  0.978978       NaN  0.392511
3  0.884089       NaN  0.900421
4  0.178159       NaN       NaN
5  0.579322       NaN       NaN

In [140]:
df3.iloc[0, 0] = NA

In [141]:
df3

          0         1         2
0       NaN  0.267049  0.550702
1  0.001706  0.557345  0.973431
2  0.978978       NaN  0.392511
3  0.884089       NaN  0.900421
4  0.178159       NaN       NaN
5  0.579322       NaN       NaN

In [142]:
# вышестоящие ячейки с методом 'bfill' заполняются значениями нижестоящих:

df3.fillna(method = 'bfill')

          0         1         2
0  0.001706  0.267049  0.550702
1  0.001706  0.557345  0.973431
2  0.978978       NaN  0.392511
3  0.884089       NaN  0.900421
4  0.178159       NaN       NaN
5  0.579322       NaN       NaN

In [ ]:
# Вы можете встретить в чужом коде method='pad' - это аналог method='ffill'. 

# Если вы встретите method='backfill'-это аналог method='bfill'.

In [ ]:
## заполнение на основе среднего значения ##

In [143]:
lst = [5, 6, None, np.nan, 8]

In [144]:
s = pd.Series(lst)

In [145]:
s.fillna(s.mean())

0    5.000000
1    6.000000
2    6.333333
3    6.333333
4    8.000000
dtype: float64

# Проверяем данные на дубликаты и избавляемся от них

In [146]:
df = pd.DataFrame({'group_name': ['A', 'B', 'A', 'B', 'A', 'B', 'B'],
                  'group_value': [10, 10, 20, 30, 30, 40, 40]})

In [147]:
df

  group_name  group_value
0          A           10
1          B           10
2          A           20
3          B           30
4          A           30
5          B           40
6          B           40

In [148]:
# по всему датафрейму - ответ на вопрос - является ли строка дубликатом или нет:

df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
# У функции duplicated можно поменять режим проверки дубликатов при помощи параметра keep:

# keep = 'first': пометить дубликаты как True, за исключением первого вхождения. 
# Т.е. первое значение не будет считаться дубликатом.

# keep = 'last': пометить дубликаты как True, за исключением последнего вхождения.
# Т.е. последнее значение не будет считаться дубликатом.

# keep = False : пометить все дубликаты как True. Т.е. все значения будут считаться дубликатами.

In [149]:
df[df.duplicated()]

  group_name  group_value
6          B           40

In [150]:
df.drop_duplicates()

  group_name  group_value
0          A           10
1          B           10
2          A           20
3          B           30
4          A           30
5          B           40

In [151]:
# выше расчет идет по двум колонкам. По group_name и group_value

# если мы хотим, чтобы дубли ловились только по одной колонке, например только по group_name:

df.drop_duplicates('group_name')

  group_name  group_value
0          A           10
1          B           10

In [ ]:
# Параметр keep у функции drop_duplicates очень важен и вы часто будете его задавать! 
    
# Он определяет, какие дубликаты (если они есть) нужно сохранить. Вот значения, которые может принимать параметр keep:

# - first : удалить дубликаты, кроме первого вхождения.

# - last : удалить дубликаты, кроме последнего вхождения.

# - False : удалить все дубликаты.

# Функция map() заточена на работу с Сериями и словарями

In [152]:
airport_data = pd.DataFrame({'airline': ['Air China', 'Jet Airways', 'Aeroflot', 'easyJet'], 'planes': [10, 4, 30, 2]})
country = {'Air China': 'China', 'Jet Airways': 'India', 'Aeroflot': 'Russia', 'easyJet': 'United Kingdom'}

In [153]:
airport_data

       airline  planes
0    Air China      10
1  Jet Airways       4
2     Aeroflot      30
3      easyJet       2

In [156]:
# функция map пробегает по всем ключам в словаре country и подставляет в Series значения этого словаря

# осуществляется перевод по словарю функцией map(dictionary)

airport_data['airline'].map(country)

0             China
1             India
2            Russia
3    United Kingdom
Name: airline, dtype: object

In [158]:
airport_data['country'] = airport_data['airline'].map(country)

In [160]:
airport_data

       airline  planes         country
0    Air China      10           China
1  Jet Airways       4           India
2     Aeroflot      30          Russia
3      easyJet       2  United Kingdom

In [163]:
#В функцию map() вместо словаря можно передать и Серию:
    
ss = pd.Series([1,2,3,4], index = ['Air China', 'Jet Airways', 'Aeroflot', 'easyJet'])

airport_data['airline'].map(ss)

0    1
1    2
2    3
3    4
Name: airline, dtype: int64